 





let board : unit = 
  ANSITerminal.resize 1 1 

let board_initiate = 
  "
===============================================================================             


                     🇯🇵                          🇺🇸                          
                  _________                   ________                        
                 |   .-.   |                 |::::====|
                 |  (   )  |                 |::::====|                       
                 |___`-'___|                 |========|                       

     🇸🇪                                                            🇨🇦        
  ________                                                      _________     
 |  ||    |                                                    |::_,^._::|    
 |==::====|                                                    |::\\___/::|    
 |__||____|                                                    |::__|__::|    
                   /\\___/\\                     (\___/)                      
                    >*.*<.                     (=^.^=)                         









                   /\___/\\                                                    
                   \\ 0.0 /                     🐫🐫🐫                        
    🇨🇳                                                             🇰🇷        
  ________                                                      _________     
 |* )     |                                                    | X  _  X |    
 |        |                                                    |   (_)   |    
 |________|                                                    |_X_____X_|    



===============================================================================
\n
"

(* 
  "  🐫🐫🐫

  /\___/\
  >^.^<.



  (\___/)
    (=^.^=)


  /\___/\
  \ ^.^ /

  " *)


let board_1 = 
  "
===============================================================================             


                     🇯🇵                          🇺🇸                          
                  _________                   ________                        
                 |   .-.   |                 |::::====|
                 |  (   )  |                 |::::====|                       
                 |___`-'___|                 |========|                       

     🇸🇪                                                            🇨🇦        
  ________                                                      _________     
 |  ||    |                                                    |::_,^._::|    
 |==::====|                                                    |::\\___/::|    
 |__||____|                                                    |::__|__::|    
                   /\\___/\\                     (\___/)                      
                    >*.*<.                     (=^.^=)                         


                                  -----
                                  |   |
                                  | o |
                                  |   |
                                  -----


                   /\___/\\                                                    
                   \\ 0.0 /                     🐫🐫🐫                        
    🇨🇳                                                             🇰🇷        
  ________                                                      _________     
 |* )     |                                                    | X  _  X |    
 |        |                                                    |   (_)   |    
 |________|                                                    |_X_____X_|    



===============================================================================
\n
"




let board_2 = 
  "
===============================================================================             


                     🇯🇵                          🇺🇸                          
                  _________                   ________                        
                 |   .-.   |                 |::::====|
                 |  (   )  |                 |::::====|                       
                 |___`-'___|                 |========|                       

     🇸🇪                                                            🇨🇦        
  ________                                                      _________     
 |  ||    |                                                    |::_,^._::|    
 |==::====|                                                    |::\\___/::|    
 |__||____|                                                    |::__|__::|    
                   /\\___/\\                     (\___/)                      
                    >*.*<.                     (=^.^=)                         


                                  -----
                                  |o  |
                                  |   |
                                  |  o|
                                  -----


                   /\___/\\                                                    
                   \\ 0.0 /                     🐫🐫🐫                        
    🇨🇳                                                             🇰🇷        
  ________                                                      _________     
 |* )     |                                                    | X  _  X |    
 |        |                                                    |   (_)   |    
 |________|                                                    |_X_____X_|    



===============================================================================
\n
"




let board_3 = 
  "
===============================================================================             


                     🇯🇵                          🇺🇸                          
                  _________                   ________                        
                 |   .-.   |                 |::::====|
                 |  (   )  |                 |::::====|                       
                 |___`-'___|                 |========|                       

     🇸🇪                                                            🇨🇦        
  ________                                                      _________     
 |  ||    |                                                    |::_,^._::|    
 |==::====|                                                    |::\\___/::|    
 |__||____|                                                    |::__|__::|    
                   /\\___/\\                     (\___/)                      
                    >*.*<.                     (=^.^=)                         


                                  -----
                                  |o  |
                                  | o |
                                  |  o|
                                  -----


                   /\___/\\                                                    
                   \\ 0.0 /                     🐫🐫🐫                        
    🇨🇳                                                             🇰🇷        
  ________                                                      _________     
 |* )     |                                                    | X  _  X |    
 |        |                                                    |   (_)   |    
 |________|                                                    |_X_____X_|    



===============================================================================
\n
"



let board_4 = 
  "
===============================================================================             


                     🇯🇵                          🇺🇸                          
                  _________                   ________                        
                 |   .-.   |                 |::::====|
                 |  (   )  |                 |::::====|                       
                 |___`-'___|                 |========|                       

    🇸🇪                                                            🇨🇦        
  ________                                                      _________     
 |  ||    |                                                    |::_,^._::|    
 |==::====|                                                    |::\\___/::|    
 |__||____|                                                    |::__|__::|    
                   /\\___/\\                     (\___/)                      
                    >*.*<.                     (=^.^=)                         


                                  -----
                                  |o o|
                                  |   |
                                  |o o|
                                  -----


                   /\___/\\                                                    
                   \\ 0.0 /                     🐫🐫🐫                        
    🇨🇳                                                             🇰🇷        
  ________                                                      _________     
 |* )     |                                                    | X  _  X |    
 |        |                                                    |   (_)   |    
 |________|                                                    |_X_____X_|    



===============================================================================
\n
"

let board_5 = 
  "
===============================================================================             


                     🇯🇵                          🇺🇸                          
                  _________                   ________                        
                 |   .-.   |                 |::::====|
                 |  (   )  |                 |::::====|                       
                 |___`-'___|                 |========|                       

     🇸🇪                                                            🇨🇦        
  ________                                                      _________     
 |  ||    |                                                    |::_,^._::|    
 |==::====|                                                    |::\\___/::|    
 |__||____|                                                    |::__|__::|    
                   /\\___/\\                     (\___/)                      
                    >*.*<.                     (=^.^=)                         


                                  -----
                                  |o o|
                                  | o |
                                  |o o|
                                  -----


                   /\___/\\                                                    
                   \\ 0.0 /                     🐫🐫🐫                        
    🇨🇳                                                             🇰🇷        
  ________                                                      _________     
 |* )     |                                                    | X  _  X |    
 |        |                                                    |   (_)   |    
 |________|                                                    |_X_____X_|    



===============================================================================
\n
"

let board_6 = 
  "
===============================================================================             


                     🇯🇵                          🇺🇸                          
                  _________                   ________                        
                 |   .-.   |                 |::::====|
                 |  (   )  |                 |::::====|                       
                 |___`-'___|                 |========|                       

     🇸🇪                                                            🇨🇦        
  ________                                                      _________     
 |  ||    |                                                    |::_,^._::|    
 |==::====|                                                    |::\\___/::|    
 |__||____|                                                    |::__|__::|    
                   /\\___/\\                     (\___/)                      
                    >*.*<.                     (=^.^=)                         


                                  -----
                                  |o o|
                                  |o o|
                                  |o o|
                                  -----


                   /\___/\\                                                    
                   \\ 0.0 /                     🐫🐫🐫                        
    🇨🇳                                                             🇰🇷        
  ________                                                      _________     
 |* )     |                                                    | X  _  X |    
 |        |                                                    |   (_)   |    
 |________|                                                    |_X_____X_|    



===============================================================================
\n
"


let china = 

  "
  🇨🇳  中国欢迎您!

                              _,add8ba,
                            ,d888888888b,
                           d8888888888888b                        _,ad8ba,_
                          I8888888888888888 _________          ,8888888888888b
                __________`Y88888888888888P88888888888baaa,__ ,888888888888888,
         ,a88^           ,d888P8888P^                           ^8Y8888888888P'
       ,a8^            ,d8888'                                     ^Y8888888P'
      a88'           ,d8888P'                                        I88P7^
   ,d88'           d888888'                                            `b,
  ,d88'           d888888I                                              `b,
  d88I           ,8888888'            ___                                `b,
 d888           ,8888888I         d88888888b,           ,d8888b,           `b
,8888           I8888888I        d8888888888I          888888888b           8,
d8886           888888888       888888888888           88888888888,        ,8b
88888b          I88888888b      `Y8888888^             `Y888888888I        d88,
`888888b         88888888888b,                           `Y8888P^        d8888
 Y888888b       ,8888888888888ba,_          _______        `88^        ,d88888
 I8888888b,    ,888888888888888888ba,_     d88888888b               ,ad8888888
 `888888888b,  I8888888888888888888888b,    ^Y8888^      ____.,ad888888888888
  88888888888b,`888888888888888888888888b,     88      ad8888888888888888888
   888888888888698888888888888888888888888b_,ad88ba,_,d88888888888888888888
    888888888888888888888888888888888888888b,`888^ d8888888888888888888888
     888888888888888888888888888888888888888baaad888888888888888888888888
      88888888888888b  `88888888888888888888888     8888888888888888888'
         Y88888888888P   `88888888888888888888888     8888888888888888
            ^888888888^      88888888888888888888,     8888888888888
                                Y8888888888888888P     `888888888
                                  `YY88888888888P'\n

"

let japan = 
  "
  🇯🇵  日本へようこそ!

                 /,   ,|   ,|
             /| /(  ,' / ,//
          \\`( |/ /,'  (,/ |
           \\ \\ ` `   `  /--,
         _,_\\ `  ` `  ``  /__
          '-.____________`  /
            [  \\@,    :] `--,-..-
            [__________]__,'-._/
             )'o\\ ' o) \\/ )
             \\  /   __  ./
              \\=`   ==,\\..
               \\ -. `,' (333
               3`--''    \\33.
             ,333_) /mm33333:.
            |:#:mmmmmm333333::
            |:#:333333333::##'
            ':#:ctr3333''#####\\
             |:#:#\\###########\\
             |:#:##\\###########\\
             |:#:###\\########|#\\
             /:#:|:::\\|::::::|:(
             ):#:|::::\\::::::|:/
            /:#;/:::::<::::::|(\n

"

let usa = 

  "
  🇺🇸  Welcome to the USA!

            .----.
           /       \\
           \\       /
    .-----.-`.-.-.<  _
   /      _,- ()()_/:)
   \\     / ,  `     `|
    '-..-| \\-.,___,  /
          \\ `-.__/  /
         / `-.__.-\\`
        / /|    ___\\
       ( ( |.-'`   `'\\
        \\ \\/ {}USA{}  |
         \\|           /
          \\        , /
          ( __`;-;'__`)
          `//'`   `||`
         _//       ||
 .--._,(__)     .(__).-'-.
/          \\    /           \\
\\          /    \\           /
 `'-------`      `--------'`

\n"


let korea = 

  "
  🇰🇷  한국에오신것을환영합니다!

  EEEEEEEEEEEEE          XXXX          XXXX              OOOOOOO 
  EEEEEEEEEEEEE           XXXX        XXXX            OOOO     OOOO
  EEE                      XXXX      XXXX            OOOO       OOOO
  EEE                       XXXX    XXXX            OOOO         OOOO
  EEEEEEEEEEEEE                 XXXX               OOOO           OOOO
  EEEEEEEEEEEEE                 XXXX               OOOO           OOOO 
  EEE                       XXXX    XXXX            OOOO         OOOO
  EEE                      XXXX      XXXX            OOOO       OOOO
  EEEEEEEEEEEEE           XXXX        XXXX            OOOO     OOOO
  EEEEEEEEEEEEE          XXXX          XXXX              OOOOOOO\n

  "


let sweden = 
  "
🇸🇪  Välkommen till Sverige!

IIIIIIII         KKKK       KKKK          EEEEEEEEEE              AAA
IIIIIIII         KKKK      KKKK           EEEEEEEEEE             AAAAA
  IIII           KKKK     KKK             EEE                   AAA  AAA
  IIII           KKKK   KKKK              EEE                  AAA    AAA
  IIII           KKKK KKK                 EEEEEEEEEE          AAA      AAA
  IIII           KKKK KKK                 EEEEEEEEEE         AAAAAAAAAAAAAA     
  IIII           KKKK   KKKK              EEE                AAAAAAAAAAAAAA        
  IIII           KKKK     KKKK            EEE               AAA          AAA
IIIIIIII         KKKK       KKKK          EEEEEEEEEE        AAA          AAA
IIIIIIII         KKKK         KKKK        EEEEEEEEEE       AAAA          AAAA\n
"

let canada = 

  "  
🇨🇦  Bienvenue au Canada!

________Justin•♥____________Justin•♥•Bi
______Justin•♥•Biebe_______Justin•♥•BieberJust
____Justin•♥•BieberJust___Justin•♥•BieberJustin•♥
___Justin•♥•BieberJustin•♥•BieberJu________Justin•
__Justin•♥•BieberJustin•♥•BieberJu__________Justin•
_Justin•♥•BieberJustin•♥•BieberJustin________Justin•
_Justin•♥•BieberJustin•♥•BieberJustin•♥•B_______Justin
Justin•♥•BieberJustin•♥•BieberJustin•♥•Biebe____Justi
Justin•♥•BieberJustin•♥•BieberJustin•♥•BieberJu___J
Justin•♥•BieberJustin•♥•BieberJustin•♥•BieberJus
_Justin•♥•BieberJustin•♥•BieberJustin•♥•Bieber
____Justin•♥•BieberJustin•♥•BieberJustin•♥•
______Justin•♥•BieberJustin•♥•BieberJust
_________Justin•♥•BieberJustin•♥•Bieb
______________Justin•♥•BieberJusti
_________________Justin•♥•Bieber
___________________Justin•♥•Bi
_____________________Justin•
______________________Justi
_______________________Ju\n

"


let get_dice_design number = 
  match number with
  | 0 -> ANSITerminal.print_string [ANSITerminal.black; ANSITerminal.on_green] board_initiate
  | 1 -> ANSITerminal.print_string [ANSITerminal.black; ANSITerminal.on_green] board_1
  | 2 -> ANSITerminal.print_string [ANSITerminal.black; ANSITerminal.on_green] board_2
  | 3 -> ANSITerminal.print_string [ANSITerminal.black; ANSITerminal.on_green] board_3
  | 4 -> ANSITerminal.print_string [ANSITerminal.black; ANSITerminal.on_green] board_4
  | 5 -> ANSITerminal.print_string [ANSITerminal.black; ANSITerminal.on_green] board_5
  | 6 -> ANSITerminal.print_string [ANSITerminal.black; ANSITerminal.on_green] board_6
  | _ -> failwith ""  

let get_country_design country_id = 
  match country_id with
  | 0 -> ANSITerminal.print_string [ANSITerminal.red] china
  | 1 -> ANSITerminal.print_string [ANSITerminal.blue] sweden
  | 2 -> ANSITerminal.print_string [ANSITerminal.cyan] japan
  | 3 -> ANSITerminal.print_string [ANSITerminal.green] usa
  | 4 -> ANSITerminal.print_string [ANSITerminal.magenta] canada
  | 5 -> ANSITerminal.print_string [ANSITerminal.yellow] korea
  | _ -> failwith "" 